Revit 2027 API
FamilySizeTableManager.NumberOfSizeTables Property
 The number of FamilySizeTables in a family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSizeTables { get; }
Public ReadOnly Property NumberOfSizeTables As Integer
	Get
public:
property int NumberOfSizeTables {
	int get ();
}
member NumberOfSizeTables : int with get
Property Value
Int32
See Also
Reference
FamilySizeTableManager Class
Autodesk.Revit.DB Namespace